РП/src/Reports/КарточкаОСМеждународныйУчет/КарточкаОСМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>КарточкаОСМеждународныйУчет</name>
</mdclass:Report>

РП/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </resources>
  <resources>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ВидАктива</name>
    <type>
      <types>EnumRef.ВидыВнеоборотныхАктивов</types>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимостьПредставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПорядокУчета</name>
    <type>
      <types>EnumRef.ПорядокУчетаСтоимостиВнеоборотныхАктивов</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПоказателиНаработки</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/AccountingRegisters/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Международный</name>
  <chartOfAccounts>ChartOfAccounts.Международный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаПредставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПроводки</name>
    <type>
      <types>CatalogRef.ШаблоныПроводокДляМеждународногоУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроводки</name>
    <type>
      <types>EnumRef.ТипыПроводокМеждународныйУчет</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

РП/src/Enums/СпособыНачисленияАмортизацииОС/СпособыНачисленияАмортизацииОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияАмортизацииОС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Линейный</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>УменьшаемогоОстатка</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Налоговый</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъемуПродукции</name>
    <comment>Пропорционально объему продукции</comment>
  </enumValues>
  <enumValues>
    <name>Кумулятивный</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоИндивидуальномуГрафику</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>УскоренногоУменьшенияОстатка</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>_100</name>
    <comment>100% в первый месяц эксплуатации</comment>
  </enumValues>
  <enumValues>
    <name>_50_50</name>
    <comment>50% в первый месяц эксплуатации, 50% при списании</comment>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ВидыСостоянийНМА/ВидыСостоянийНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСостоянийНМА</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>НеПринятКУчету</name>
  </enumValues>
  <enumValues>
    <name>Поступил</name>
  </enumValues>
  <enumValues>
    <name>ПринятКУчету</name>
  </enumValues>
  <enumValues>
    <name>Списан</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ОбъектыЭксплуатации/ОбъектыЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыЭксплуатации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ГруппаОСМеждународныйУчет</name>
    <type>
      <types>CatalogRef.ГруппыОСМеждународныйУчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСведений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкласс</name>
    <type>
      <types>CatalogRef.ПодклассыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>Расположение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РемонтирующееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭксплуатирующееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияЗарплаты</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыУчетаНаработок</name>
    <attributes>
      <name>ПоказательНаработки</name>
      <type>
        <types>CatalogRef.ПоказателиНаработки</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначенныйРесурс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеЗначения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Reports/КарточкаОСМеждународныйУчет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует отчет в табличном документе по указанному объекту основного средства
//
// Параметры:
// 		ТабличныйДокумент - ТабличныйДокумент - Табличный документ, в котором необходимо сформировать отчет
// 		Список - Массив, СписокЗначений - список объектов типа <СправочникСсылка.ОбъектыЭксплуатации> по которым необходимо сформировать отчет
//
Процедура СформироватьОтчет(ТабличныйДокумент, Список) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	
	Запрос = Новый Запрос(ТекстЗапроса());
	Запрос.УстановитьПараметр("Объекты", Список);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблЗаголовокРаздела = Макет.ПолучитьОбласть("ЗаголовокРаздела");
	ОблОсновные = Макет.ПолучитьОбласть("Основные");
	ОблАмортизация = Макет.ПолучитьОбласть("Амортизация");
	ОблАмортизацияСрок = Макет.ПолучитьОбласть("АмортизацияСрок");
	ОблАмортизацияНаработка = Макет.ПолучитьОбласть("АмортизацияНаработка");
	ОблПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОблНеПринятоКУчету = Макет.ПолучитьОбласть("ЗаголовокНеПринятоКУчету");
	
	МетодЛинейный = Перечисления.СпособыНачисленияАмортизацииОС.Линейный;
	МетодОстатка = Перечисления.СпособыНачисленияАмортизацииОС.УменьшаемогоОстатка;
	МетодНаработки = Перечисления.СпособыНачисленияАмортизацииОС.ПропорциональноОбъемуПродукции;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОблЗаголовок.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОблЗаголовок);
		
		Если Выборка.Состояние = Перечисления.СостоянияОС.НеПринятоКУчету Тогда
			ТабличныйДокумент.Вывести(ОблНеПринятоКУчету);
			Продолжить;
		КонецЕсли;
		
		ТабличныйДокумент.НачатьГруппуСтрок("Объект", Истина);
		
		ТабличныйДокумент.Вывести(ОблПустаяСтрока);
		
		#Область ОсновныеСведения
		ОблЗаголовокРаздела.Параметры.Заголовок = НСтр("ru='Основные сведения';uk='Основні відомості'");
		ТабличныйДокумент.Вывести(ОблЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок("ОсновныеСведения", Истина);
		
		ОблОсновные.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОблОсновные);
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		#КонецОбласти
		
		ТабличныйДокумент.Вывести(ОблПустаяСтрока);
		
		#Область ПараметрыАмортизации
		ОблЗаголовокРаздела.Параметры.Заголовок = НСтр("ru='Амортизация';uk='Амортизація'");
		ТабличныйДокумент.Вывести(ОблЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок("Амортизация", Истина);
		
		ОблАмортизация.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ОблАмортизация);
		
		Если Выборка.МетодНачисленияАмортизации = МетодЛинейный
			Или Выборка.МетодНачисленияАмортизации = МетодОстатка Тогда
			ОблАмортизацияСрок.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОблАмортизацияСрок);
		КонецЕсли;
		Если Выборка.МетодНачисленияАмортизации = МетодНаработки Тогда
			ОблАмортизацияНаработка.Параметры.Заполнить(Выборка);
			ТабличныйДокумент.Вывести(ОблАмортизацияНаработка);
		КонецЕсли;
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		#КонецОбласти
		
		ТабличныйДокумент.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса()
	
	Возврат
	"ВЫБРАТЬ
	|	Объекты.Ссылка КАК Объект,
	|	СостоянияТекущие.Организация,
	|	СостоянияТекущие.СчетУчета,
	|	СостоянияТекущие.ЛиквидационнаяСтоимость,
	|	СостоянияТекущие.МетодНачисленияАмортизации,
	|	СостоянияТекущие.ПорядокУчета,
	|	СостоянияТекущие.СчетАмортизации,
	|	СостоянияТекущие.СрокИспользования,
	|	СостоянияТекущие.ОбъемНаработки,
	|	ЕСТЬNULL(СостоянияТекущие.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.НеПринятоКУчету)) КАК Состояние,
	|	ЕСТЬNULL(СостоянияСписания.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоПринятияКУчету,
	|	СостоянияТекущие.ИнвентарныйНомер
	|ПОМЕСТИТЬ СостоянияТекущие
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК Объекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(, ОсновноеСредство В (&Объекты)) КАК СостоянияТекущие
	|		ПО Объекты.Ссылка = СостоянияТекущие.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет.СрезПоследних(
	|				,
	|				ОсновноеСредство В (&Объекты)
	|					И Состояние <> ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийНМА.ПринятКУчету)) КАК СостоянияСписания
	|		ПО Объекты.Ссылка = СостоянияСписания.ОсновноеСредство
	|ГДЕ
	|	Объекты.Ссылка В(&Объекты)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияПринятияКУчету.Период) КАК Период,
	|	ДвиженияПринятияКУчету.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ПериодыСостояний
	|ИЗ
	|	СостоянияТекущие КАК СостоянияТекущие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ДвиженияПринятияКУчету
	|		ПО СостоянияТекущие.Объект = ДвиженияПринятияКУчету.ОсновноеСредство
	|			И СостоянияТекущие.ДатаДоПринятияКУчету < ДвиженияПринятияКУчету.Период
	|ГДЕ
	|	ДвиженияПринятияКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.ВидыСостоянийНМА.ПринятКУчету)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияПринятияКУчету.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МеждународныйОстатки.Субконто1 КАК Актив,
	|	МеждународныйОстатки.СуммаОборотДт КАК Сумма
	|ПОМЕСТИТЬ Стоимость
	|ИЗ
	|	РегистрБухгалтерии.Международный.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СостоянияТекущие.СчетУчета
	|				ИЗ
	|					СостоянияТекущие КАК СостоянияТекущие),
	|			,
	|			(Организация, Субконто1) В
	|				(ВЫБРАТЬ
	|					СостоянияТекущие.Организация,
	|					СостоянияТекущие.Объект
	|				ИЗ
	|					СостоянияТекущие КАК СостоянияТекущие)) КАК МеждународныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МеждународныйОстатки.Субконто1 КАК Актив,
	|	МеждународныйОстатки.СуммаОборотКт КАК Сумма
	|ПОМЕСТИТЬ НачисленнаяАмортизация
	|ИЗ
	|	РегистрБухгалтерии.Международный.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			Счет В
	|				(ВЫБРАТЬ
	|					СостоянияТекущие.СчетАмортизации
	|				ИЗ
	|					СостоянияТекущие КАК СостоянияТекущие),
	|			,
	|			(Организация, Субконто1) В
	|				(ВЫБРАТЬ
	|					СостоянияТекущие.Организация,
	|					СостоянияТекущие.Объект
	|				ИЗ
	|					СостоянияТекущие КАК СостоянияТекущие)) КАК МеждународныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Объекты.Ссылка КАК ОсновноеСредство,
	|	СостоянияТекущие.Организация,
	|	СостоянияТекущие.Состояние КАК Состояние,
	|	СостоянияТекущие.СчетУчета,
	|	Стоимость.Сумма КАК ПервоначальнаяСтоимость,
	|	0 КАК СправедливаяСтоимость,
	|	СостоянияТекущие.ЛиквидационнаяСтоимость,
	|	СостоянияТекущие.МетодНачисленияАмортизации,
	|	НачисленнаяАмортизация.Сумма КАК СуммаНачисленнойАмортизации,
	|	СостоянияТекущие.СчетАмортизации,
	|	СостоянияТекущие.СрокИспользования,
	|	СостоянияТекущие.ОбъемНаработки,
	|	Объекты.НаименованиеПолное,
	|	Объекты.Наименование КАК Наименование,
	|	Объекты.ГруппаОСМеждународныйУчет КАК Группа,
	|	ПериодыСостояний.Период КАК ДатаПринятияКУчету,
	|	СостоянияТекущие.ИнвентарныйНомер
	|ИЗ
	|	Справочник.ОбъектыЭксплуатации КАК Объекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияТекущие КАК СостоянияТекущие
	|		ПО Объекты.Ссылка = СостоянияТекущие.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ Стоимость КАК Стоимость
	|		ПО Объекты.Ссылка = Стоимость.Актив
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленнаяАмортизация КАК НачисленнаяАмортизация
	|		ПО Объекты.Ссылка = НачисленнаяАмортизация.Актив
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыСостояний КАК ПериодыСостояний
	|		ПО Объекты.Ссылка = ПериодыСостояний.ОсновноеСредство
	|ГДЕ
	|	Объекты.Ссылка В(&Объекты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
КонецФункции

#КонецОбласти

#КонецЕсли
